# SetClTextureL

## Description
Procedure SetClTextureL sets the left side wall texture of the specified class.

```pascal
PROCEDURE SetClTextureL(
				className  : STRING;
				textureRef : LONGINT);
```

```python
def vs.SetClTextureL(className, textureRef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|
|textureRef|LONGINT|Texture reference index value.|

## Remarks
Sets the wall left texture of the class named className.

## Version
Availability: from VectorWorks8.0

## Category
* Textures